# Importing libraries

In [1]:
# import libraries
import pandas as pd
import numpy as np
import os

In [ ]:
# Using path method to import the  prodcuts csv
"C:\Users\Peter\Desktop\Data Analytics documents\Data Immersion\Achievement 4\09-2020 Instacart Basket Analysis"

In [2]:
path = r"C:\Users\Peter\Desktop\Data Analytics documents\Data Immersion\Achievement 4\09-2020 Instacart Basket Analysis"

In [3]:
path

'C:\\Users\\Peter\\Desktop\\Data Analytics documents\\Data Immersion\\Achievement 4\\09-2020 Instacart Basket Analysis'

In [4]:
# imported the products csv file
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

In [5]:
# imported the orders_wrangled csv file
dfords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

In [6]:
# create a dataframe
df_test = pd.DataFrame()

In [7]:
# create a mixed type column
df_test['mix'] = ['a','b',1,True]

In [8]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [9]:
# checking for mixed data type
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [10]:
df_test['mix'] = df_test['mix'].astype('str')

In [11]:
df_test['mix'].astype

<bound method NDFrame.astype of 0       a
1       b
2       1
3    True
Name: mix, dtype: object>

In [12]:
# checking for any missing value in df_prods dataframe
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [13]:
# printing the missing values and converting it to a dataframe
df_nan = df_prods[df_prods['product_name'].isnull()==True]

In [14]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [15]:
# printing out the number of row in products dataframe before creating a subset
df_prods.shape

(49693, 5)

In [16]:
# creating a subset of dataframe with only data without missing names
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [17]:
df_prods_clean.shape

(49677, 5)

In [18]:
# checking for duplicate in the df-prodcuts-clean dataframe
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [19]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [20]:
# checking for the number of rows in the df_prods_clean.shape before removing the duplicate
df_prods_clean.shape

(49677, 5)

In [21]:
# removing the duplicate from the df_prods_clean.shape
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [22]:
df_prods_clean_no_dups.shape

(49672, 5)

# Performing task 4.5

In [23]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

Product_id: This column can contain numbers from 1 to infinite, so the mini and maxi, is okay. Howvere, this column is not important for statistical analysis.
Aisle_id: This column can contain numbers from 1 to infinite, so the mini and maxi, is okay. Howvere, this column is not important for statistical analysis.
Department_id: This column can contain numbers from 1 to 21. so the mini and maxi, which is 1 and 21 are correct and falls within the range. 
Prices: This column can contain any numbers and not string. And the values could varies as well. 
In general there is nothing strange about this dataframe that needs further investigation.

In [31]:
# imported the orders csv file
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders.csv'), index_col = False)

In [32]:
# checking for mixed data type in my orders csv
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

The above command function does not shown any mix data type in the dataframe.

In [33]:
# checking for any missing value in my ords dataframe
df_ords.isnull().sum()

order_id                       0
user_id                        0
eval_set                       0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

The above function return a missing values in the days_since_prior_order column. While there was no missing values in other columns.The reason for the missing values might be as a result of inconsistent orders from customers. Take for example customer A orders on day_1 and day_2,3,...28 he/she did mot order, so no information about the order details will be filled in in these days.Therefore, the dataframe will remain without been changed.

In [34]:
# checking for duplicate in the df-ords dataframe
df_ords_dup = df_ords[df_ords.duplicated()]

In [35]:
df_ords_dup

Empty DataFrame
Columns: [order_id, user_id, eval_set, order_number, order_dow, order_hour_of_day, days_since_prior_order]
Index: []

There is no duplicate found in this datafram as shwon above.

In [36]:
df_ords.shape

(3421083, 7)

In [37]:
# Exporting products_clean to my prepared data as csv
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))

In [38]:
# Exporting orders_clean to my prepared data as csv
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'))